Vamshi-Mohan1/STM32_Project/5_GPIO_EXTI/Src/main.c

#include <stdint.h>
#include<stdio.h>
#include "stm32l4xx_hal.h"



void gpio_pc13_interrupt_init(void);
#define BTN_PORT GPIOC
#define BTN_PIN GPIO_PIN_13
#define LED_PORT GPIOA
#define LED_PIN GPIO_PIN_5



int main(void)
{
   HAL_Init();
   gpio_pc13_interrupt_init();

   while(1)
   {

   }

}



void gpio_pc13_interrupt_init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};
	__HAL_RCC_GPIOC_CLK_ENABLE();
	__HAL_RCC_GPIOA_CLK_ENABLE();
	//Configure PC13
	GPIO_InitStruct.Pin = BTN_PIN;
	GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(BTN_PORT, &GPIO_InitStruct );




	//Configure PA5

	GPIO_InitStruct.Pin = LED_PIN;
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
		HAL_GPIO_Init(LED_PORT, &GPIO_InitStruct );






		HAL_NVIC_SetPriority(EXTI15_10_IRQn,0,0);//(IRQn  , PreemptPriority, SubPriority)
		HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);//IRQn
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	//Do Something

	 HAL_GPIO_TogglePin(LED_PORT, LED_PIN);


  }

void EXTI15_10_IRQHandler(void)
{
	//Do somthing.
	HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_13);
}

